In [18]:
import match
import pandas as pd
import seaborn as sns

In [15]:
titanic_data = pd.read_csv('./../data/titanic_data.csv')

In [16]:
titanic_data.pclass.value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [8]:
titanic_numerical = titanic_data[[ 'age', 'sibsp', 'parch', 'fare']]
titanic_categorical = titanic_data[['pclass', 'sex', 'embarked']]
titanic_categorical = pd.get_dummies(titanic_categorical)
titanic_categorical['first_class?'] = titanic_categorical.pclass.apply(lambda x: 1 if x == 1 else 0)

In [12]:
titanic_clean = pd.concat([titanic_numerical, titanic_categorical[['first_class?', 'sex_male', 'embarked_C', 'embarked_Q']]], axis=1)
titanic_clean.dropna(inplace=True)

In [13]:
titanic_clean['first_class?'].value_counts()

0    528
1    186
Name: first_class?, dtype: int64

In [6]:
preds = ['age', 'sibsp', 'parch', 'fare', 'sex_male', 'embarked_C', 'embarked_Q']

titanic_clean[preds]

      age  sibsp  parch     fare  sex_male  embarked_C  embarked_Q
0    22.0      1      0   7.2500         1           0           0
1    38.0      1      0  71.2833         0           1           0
2    26.0      0      0   7.9250         0           0           0
3    35.0      1      0  53.1000         0           0           0
4    35.0      0      0   8.0500         1           0           0
..    ...    ...    ...      ...       ...         ...         ...
885  39.0      0      5  29.1250         0           0           1
886  27.0      0      0  13.0000         1           0           0
887  19.0      0      0  30.0000         0           0           0
889  26.0      0      0  30.0000         1           1           0
890  32.0      0      0   7.7500         1           0           1

[714 rows x 7 columns]

In [17]:
titanic_final = match.match(titanic_clean, 'first_class?', output_csv='./../data/titanic_matched.csv')

<class 'pandas.core.frame.DataFrame'>
Generating Logistic Regression Model...
Model Generated
Matching Propesensity Scores...
Matching Complete

In [10]:
sns.

1    186
0    186
Name: first_class?, dtype: int64